{
  "architectures": [
    "Qwen3_5MoeForCausalLM"
  ],
  "attention_bias": false,
  "attention_dropout": 0.0,
  "attn_output_gate": true,
  "bos_token_id": null,
  "dtype": "float32",
  "eos_token_id": null,
  "head_dim": 32,
  "hidden_act": "silu",
  "hidden_size": 64,
  "initializer_range": 0.02,
  "intermediate_size": 32,
  "layer_types": [
    "linear_attention",
    "linear_attention",
    "linear_attention",
    "full_attention",
    "linear_attention",
    "linear_attention",
    "linear_attention",
    "full_attention"
  ],
  "linear_conv_kernel_dim": 4,
  "linear_key_head_dim": 16,
  "linear_num_key_heads": 2,
  "linear_num_value_heads": 4,
  "linear_value_head_dim": 16,
  "max_position_embeddings": 4096,
  "model_type": "qwen3_5_moe_text",
  "moe_intermediate_size": 32,
  "mtp_num_hidden_layers": 0,
  "num_attention_heads": 4,
  "num_experts": 8,
  "num_experts_per_tok": 2,
  "num_hidden_layers": 8,
  "num_key_value_heads": 2,
  "output_router_logits": false,
  "pad_token_id": null,
  "partial_rotary_factor": 0.25,
  "rms_norm_eps": 1e-06,
  "rope_parameters": {
    "mrope_interleaved": true,
    "mrope_section": [
      2,
      1,
      1
    ],
    "partial_rotary_factor": 0.25,
    "rope_theta": 10000000,
    "rope_type": "default"
  },
  "router_aux_loss_coef": 0.001,
  "shared_expert_intermediate_size": 32,
  "tie_word_embeddings": false,
  "transformers_version": "5.13.1",
  "use_cache": true,
  "vocab_size": 512
}
