{
  "architectures": [
    "Gemma4ForCausalLM"
  ],
  "attention_bias": false,
  "attention_dropout": 0.0,
  "attention_k_eq_v": true,
  "bos_token_id": 2,
  "dtype": "float32",
  "enable_moe_block": true,
  "eos_token_id": 1,
  "final_logit_softcapping": 30.0,
  "global_head_dim": 32,
  "head_dim": 16,
  "hidden_activation": "gelu_pytorch_tanh",
  "hidden_size": 64,
  "hidden_size_per_layer_input": 0,
  "initializer_range": 0.02,
  "intermediate_size": 48,
  "layer_types": [
    "sliding_attention",
    "sliding_attention",
    "sliding_attention",
    "sliding_attention",
    "sliding_attention",
    "full_attention",
    "sliding_attention",
    "sliding_attention",
    "sliding_attention",
    "sliding_attention",
    "sliding_attention",
    "full_attention"
  ],
  "max_position_embeddings": 4096,
  "model_type": "gemma4_text",
  "moe_intermediate_size": 16,
  "num_attention_heads": 4,
  "num_experts": 8,
  "num_global_key_value_heads": 1,
  "num_hidden_layers": 12,
  "num_key_value_heads": 2,
  "num_kv_shared_layers": 0,
  "pad_token_id": 0,
  "rms_norm_eps": 1e-06,
  "rope_parameters": {
    "full_attention": {
      "partial_rotary_factor": 0.25,
      "rope_theta": 1000000.0,
      "rope_type": "proportional"
    },
    "sliding_attention": {
      "rope_theta": 10000.0,
      "rope_type": "default"
    }
  },
  "sliding_window": 8,
  "tie_word_embeddings": true,
  "top_k_experts": 2,
  "transformers_version": "5.13.1",
  "use_bidirectional_attention": null,
  "use_cache": true,
  "use_double_wide_mlp": false,
  "vocab_size": 512,
  "vocab_size_per_layer_input": 262144
}
